{
   "class_name":"Sequential",
   "keras_version":"2.2.2",
   "backend":"tensorflow",
   "config":[
      {
         "class_name":"Conv2D",
         "config":{
            "bias_initializer":{
               "class_name":"Zeros",
               "config":{

               }
            },
            "trainable":true,
            "filters":64,
            "kernel_constraint":null,
            "dtype":"float32",
            "data_format":"channels_last",
            "dilation_rate":[
               1,
               1
            ],
            "batch_input_shape":[
               null,
               28,
               28,
               1
            ],
            "kernel_regularizer":null,
            "use_bias":true,
            "padding":"same",
            "kernel_size":[
               5,
               5
            ],
            "name":"conv2d_1",
            "bias_constraint":null,
            "kernel_initializer":{
               "class_name":"VarianceScaling",
               "config":{
                  "seed":null,
                  "mode":"fan_avg",
                  "distribution":"uniform",
                  "scale":1.0
               }
            },
            "activity_regularizer":null,
            "strides":[
               1,
               1
            ],
            "bias_regularizer":null,
            "activation":"relu"
         }
      },
      {
         "class_name":"Conv2D",
         "config":{
            "bias_initializer":{
               "class_name":"Zeros",
               "config":{

               }
            },
            "trainable":true,
            "filters":40,
            "kernel_constraint":null,
            "data_format":"channels_last",
            "dilation_rate":[
               1,
               1
            ],
            "kernel_regularizer":null,
            "use_bias":true,
            "padding":"same",
            "kernel_size":[
               3,
               3
            ],
            "name":"conv2d_2",
            "bias_constraint":null,
            "kernel_initializer":{
               "class_name":"VarianceScaling",
               "config":{
                  "seed":null,
                  "mode":"fan_avg",
                  "distribution":"uniform",
                  "scale":1.0
               }
            },
            "activity_regularizer":null,
            "strides":[
               1,
               1
            ],
            "bias_regularizer":null,
            "activation":"relu"
         }
      },
      {
         "class_name":"MaxPooling2D",
         "config":{
            "trainable":true,
            "name":"max_pooling2d_1",
            "data_format":"channels_last",
            "padding":"valid",
            "pool_size":[
               2,
               2
            ],
            "strides":[
               2,
               2
            ]
         }
      },
      {
         "class_name":"Dropout",
         "config":{
            "rate":0.25,
            "seed":null,
            "trainable":true,
            "name":"dropout_1",
            "noise_shape":null
         }
      },

      {
         "class_name":"Conv2D",
         "config":{
            "bias_initializer":{
               "class_name":"Zeros",
               "config":{

               }
            },
            "trainable":true,
            "filters":56,
            "kernel_constraint":null,
            "data_format":"channels_last",
            "dilation_rate":[
               1,
               1
            ],
            "kernel_regularizer":null,
            "use_bias":true,
            "padding":"same",
            "kernel_size":[
               4,
               4
            ],
            "name":"conv2d_3",
            "bias_constraint":null,
            "kernel_initializer":{
               "class_name":"VarianceScaling",
               "config":{
                  "seed":null,
                  "mode":"fan_avg",
                  "distribution":"uniform",
                  "scale":1.0
               }
            },
            "activity_regularizer":null,
            "strides":[
               1,
               1
            ],
            "bias_regularizer":null,
            "activation":"relu"
         }
      },
      {
         "class_name":"Conv2D",
         "config":{
            "bias_initializer":{
               "class_name":"Zeros",
               "config":{

               }
            },
            "trainable":true,
            "filters":56,
            "kernel_constraint":null,
            "data_format":"channels_last",
            "dilation_rate":[
               1,
               1
            ],
            "kernel_regularizer":null,
            "use_bias":true,
            "padding":"same",
            "kernel_size":[
               2,
               2
            ],
            "name":"conv2d_4",
            "bias_constraint":null,
            "kernel_initializer":{
               "class_name":"VarianceScaling",
               "config":{
                  "seed":null,
                  "mode":"fan_avg",
                  "distribution":"uniform",
                  "scale":1.0
               }
            },
            "activity_regularizer":null,
            "strides":[
               1,
               1
            ],
            "bias_regularizer":null,
            "activation":"relu"
         }
      },
      {
         "class_name":"Dropout",
         "config":{
            "rate":0.25,
            "seed":null,
            "trainable":true,
            "name":"dropout_2",
            "noise_shape":null
         }
      },
      {
         "class_name":"Flatten",
         "config":{
            "trainable":true,
            "name":"flatten_1",
            "data_format":"channels_last"
         }
      },

      {
         "class_name":"Dense",
         "config":{
            "bias_initializer":{
               "class_name":"Zeros",
               "config":{

               }
            },
            "kernel_regularizer":null,
            "units":224,
            "use_bias":true,
            "kernel_constraint":null,
            "activity_regularizer":null,
            "name":"dense_1",
            "bias_constraint":null,
            "kernel_initializer":{
               "class_name":"VarianceScaling",
               "config":{
                  "seed":null,
                  "mode":"fan_avg",
                  "distribution":"uniform",
                  "scale":1.0
               }
            },
            "trainable":true,
            "bias_regularizer":null,
            "activation":"relu"
         }
      },
      {
         "class_name":"Dropout",
         "config":{
            "rate":0.2,
            "seed":null,
            "trainable":true,
            "name":"dropout_3",
            "noise_shape":null
         }
      },
      {
         "class_name":"Dense",
         "config":{
            "bias_initializer":{
               "class_name":"Zeros",
               "config":{

               }
            },
            "kernel_regularizer":null,
            "units":75,
            "use_bias":true,
            "kernel_constraint":null,
            "activity_regularizer":null,
            "name":"dense_2",
            "bias_constraint":null,
            "kernel_initializer":{
               "class_name":"VarianceScaling",
               "config":{
                  "seed":null,
                  "mode":"fan_avg",
                  "distribution":"uniform",
                  "scale":1.0
               }
            },
            "trainable":true,
            "bias_regularizer":null,
            "activation":"relu"
         }
      },
      {
         "class_name":"Dropout",
         "config":{
            "rate":0.2,
            "seed":null,
            "trainable":true,
            "name":"dropout_4",
            "noise_shape":null
         }
      },
      {
         "class_name":"Dense",
         "config":{
            "bias_initializer":{
               "class_name":"Zeros",
               "config":{

               }
            },
            "kernel_regularizer":null,
            "units":10,
            "use_bias":true,
            "kernel_constraint":null,
            "activity_regularizer":null,
            "name":"dense_3",
            "bias_constraint":null,
            "kernel_initializer":{
               "class_name":"VarianceScaling",
               "config":{
                  "seed":null,
                  "mode":"fan_avg",
                  "distribution":"uniform",
                  "scale":1.0
               }
            },
            "trainable":true,
            "bias_regularizer":null,
            "activation":"sigmoid"
         }
      }
   ]
}