{
   "keras_version":"2.2.2",
   "backend":"tensorflow",
   "config":[
      {
         "config":{
            "trainable":true,
            "bias_constraint":null,
            "activity_regularizer":null,
            "bias_regularizer":null,
            "bias_initializer":{
               "config":{

               },
               "class_name":"Zeros"
            },
            "kernel_constraint":null,
            "name":"dense_1",
            "activation":"relu",
            "kernel_initializer":{
               "config":{
                  "stddev":0.05,
                  "mean":0.0,
                  "seed":null
               },
               "class_name":"RandomNormal"
            },
            "batch_input_shape":[
               null,
               784
            ],
            "dtype":"float32",
            "kernel_regularizer":null,
            "use_bias":true,
            "units":784
         },
         "class_name":"Dense"
      },
      {
         "config":{
            "trainable":true,
            "bias_constraint":null,
            "name":"dense_2",
            "bias_regularizer":null,
            "bias_initializer":{
               "config":{

               },
               "class_name":"Zeros"
            },
            "kernel_constraint":null,
            "activity_regularizer":null,
            "activation":"sigmoid",
            "kernel_initializer":{
               "config":{
                  "stddev":0.05,
                  "mean":0.0,
                  "seed":null
               },
               "class_name":"RandomNormal"
            },
            "kernel_regularizer":null,
            "use_bias":true,
            "units":10
         },
         "class_name":"Dense"
      }
   ],
   "class_name":"Sequential"
}